src/Enums/РежимыФормированияРасходныхОрдеров/РежимыФормированияРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыФормированияРасходныхОрдеров</name>
  <enumValues>
    <name>Менеджером</name>
  </enumValues>
  <enumValues>
    <name>Кладовщиком</name>
  </enumValues>
  <enumValues>
    <name>Автоматически</name>
  </enumValues>
</mdclass:Enum>

src/Enums/РежимыФормированияРасходныхОрдеров/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по типу номенклатуры
//
// Параметры:
//  ТипНоменклатуры	 - ПеречислениеСсылка.ТипыНоменклатуры
// 
// Возвращаемое значение:
//   Строка
//
Функция ПодсказкаПоРежимуФормирования(РежимФормированияРасходныхОрдеров) Экспорт
	
	Если РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Автоматически Тогда
		Возврат НСтр("ru='Ордера формируются и переформировываются автоматически после записи документов, влияющих на их формирование: заказов, накладных, заданий на перевозку.';uk='Ордери формуються і переформовуються автоматично після запису документів, що впливають на їх формування: замовлень, накладних, завдань на перевезення.'");
	ИначеЕсли РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Кладовщиком Тогда
		Возврат НСтр("ru='Кладовщик вручную инициирует формирование и переформирование расходных ордеров по распоряжениям на отгрузку в рабочем месте ""Отгрузка"".';uk='Комірник вручну ініціює формування і переформування видаткових ордерів по розпорядженням на відвантаження в робочому місці ""Відвантаження"".'");
	ИначеЕсли РежимФормированияРасходныхОрдеров = Перечисления.РежимыФормированияРасходныхОрдеров.Менеджером Тогда
		Возврат НСтр("ru='Менеджер инициирует формирование и переформирование расходных ордеров из списков распоряжений на отгрузку (т.е. из списков заказов и накладных). При использовании доставки ордера формирует менеджер по доставке в целом по заданию на перевозку.';uk='Менеджер ініціює формування і переформування видаткових ордерів зі списків розпоряджень на відвантаження (тобто зі списків замовлень, накладних). При використанні доставки ордера формує менеджер по доставці в цілому за завданням на перевезення.'");
	Иначе
		Возврат НСтр("ru='Определяет инициатора формирования расходных ордеров.';uk='Визначає ініціатора формування видаткових ордерів.'");
	КонецЕсли;	
	
КонецФункции

#КонецОбласти
